src/bsl/InformationRegisters/гкс_ЗаблокированныеРегистрацииУсиленныйКонтроль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ЗаблокированныеРегистрацииУсиленныйКонтроль</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БлокирующееСостояниеКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БлокирующаяРегистрация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БлокирующаяГруппаТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ГруппыТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_СостоянияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияКачества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОбщегоРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПробыНеТребуются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятоВходнойКонтроль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ЗаблокированныеРегистрацииУсиленныйКонтроль/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает блокировку ТС по правилу "Первое ТС".
// Создаёт запись в регистре при регистрации второго и последующих ТС поставщика,
// если первое ТС ещё не прошло лабораторный анализ.
//
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - блокируемая регистрация (второе+ ТС)
//  БлокирующаяРегистрация - ДокументСсылка.гкс_РегистрацияНаПЛК - регистрация первого ТС
//  Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - показатель контроля
//
Процедура ЗаписатьБлокировкуТС(ДокументРегистрации, БлокирующаяРегистрация, Показатель) Экспорт

	ДобавитьЗаписьБлокировки(ДокументРегистрации, Показатель, БлокирующаяРегистрация,
		Справочники.гкс_ГруппыТС.ПустаяСсылка(),
		Перечисления.гкс_СостоянияКачества.ПустаяСсылка());


КонецПроцедуры

// Записывает блокировку ТС по правилу "Группа ТС".
// Создаёт запись в регистре, если промежуточный композит предыдущей группы ещё не завершён.
//
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - блокируемая регистрация
//  БлокирующаяРегистрация -
// Блокирующая регистрация
//  СостояниеКачестваПервоеТС Состояние качества первое ТС
//  БлокирующаяГруппаТС - СправочникСсылка.гкс_ГруппыТС - группа ТС, вызвавшая блокировку
//  АнализГруппыЗавершен -
// Анализ группы завершен
//  СостояниеКачестваГруппы Состояние качества группы
//  Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - показатель контроля
Процедура ЗаписатьБлокировкуГруппыТС(ДокументРегистрации, БлокирующаяРегистрация, СостояниеКачестваПервоеТС,
		БлокирующаяГруппаТС, АнализГруппыЗавершен, СостояниеКачестваГруппы, Показатель) Экспорт

	ПустоеСостояниеКачества = Перечисления.гкс_СостоянияКачества.ПустаяСсылка();

	Если ГруппаТСТребуетБлокировки(БлокирующаяГруппаТС, АнализГруппыЗавершен, СостояниеКачестваГруппы) Тогда
		ДобавитьЗаписьБлокировки(ДокументРегистрации, Показатель,
			Документы.гкс_РегистрацияНаПЛК.ПустаяСсылка(), БлокирующаяГруппаТС,
			ПустоеСостояниеКачества);
	ИначеЕсли ПервоеТСТребуетБлокировки(СостояниеКачестваПервоеТС) Тогда
		ДобавитьЗаписьБлокировки(ДокументРегистрации, Показатель, БлокирующаяРегистрация,
			Справочники.гкс_ГруппыТС.ПустаяСсылка(), ПустоеСостояниеКачества);
	КонецЕсли;

КонецПроцедуры

// Обновляет состояние блокировки при завершении лабораторного анализа.
// Если качество принято - устанавливает Разблокировано = Истина.
// Если качество не принято или РПП - записывает БлокирующееСостояниеКачества.
//
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - заблокированная регистрация
//  Показатель -
// Показатель
//  СостояниеКачества -
// Состояние качества
//  БлокирующаяРегистрация - ДокументСсылка.гкс_РегистрацияНаПЛК - регистрация первого ТС
// Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - показатель контроля
// СостояниеКачества - ПеречислениеСсылка.гкс_СостоянияКачества - новое состояние качества
//  БлокирующаяГруппаТС - Неопределено - Блокирующая группа ТС
//  ИзменитьСостояниеКачества - Булево - Изменить состояние качества
Процедура ОбновитьСостояниеБлокировки(ДокументРегистрации, Показатель,
		СостояниеКачества, БлокирующаяРегистрация = Неопределено, БлокирующаяГруппаТС = Неопределено,
		ИзменитьСостояниеКачества = Ложь) Экспорт

		Если ЗначениеЗаполнено(БлокирующаяРегистрация) Тогда
			НаборЗаписей = НаборЗаписейСОтбором(ДокументРегистрации, Показатель, БлокирующаяРегистрация);
		Иначе
			НаборЗаписей = НаборЗаписейСОтбором(ДокументРегистрации, Показатель, , БлокирующаяГруппаТС);
		КонецЕсли;

		НаборЗаписей.Прочитать();

		Для Каждого Запись Из НаборЗаписей Цикл
			Если СостояниеКачества = Перечисления.гкс_СостоянияКачества.КачествоПринято Тогда
				Запись.Разблокировано = Истина;
			ИначеЕсли ИзменитьСостояниеКачества
				И (СостояниеКачества = Перечисления.гкс_СостоянияКачества.КачествоНеПринято
				Или СостояниеКачества = Перечисления.гкс_СостоянияКачества.РезультатыПробПолучены) Тогда
				Запись.БлокирующееСостояниеКачества = СостояниеКачества;
				Запись.Разблокировано = Ложь;
			КонецЕсли;
		КонецЦикла;

		Если НаборЗаписей.Модифицированность() Тогда
			НаборЗаписей.Записать();
		КонецЕсли;

КонецПроцедуры


// GKSTCPLK-2338: Записывает блокировку ТС при КачествоНеПринято первого ТС.
// Одна запись в регистр сразу с БлокирующееСостояниеКачества.
//
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - блокируемая регистрация
//  Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - показатель контроля
//  БлокирующаяРегистрация - ДокументСсылка.гкс_РегистрацияНаПЛК - регистрация первого ТС (или пустая)
//  БлокирующаяГруппаТС - СправочникСсылка.гкс_ГруппыТС - группа-блокиратор (или пустая)
//  БлокирующееСостояниеКачества - ПеречислениеСсылка.гкс_СостоянияКачества - состояние качества
Процедура ЗаписатьБлокировкуСОтказомКачества(ДокументРегистрации, Показатель,
		БлокирующаяРегистрация, БлокирующаяГруппаТС, БлокирующееСостояниеКачества) Экспорт

	ДобавитьЗаписьБлокировки(ДокументРегистрации, Показатель,
		БлокирующаяРегистрация, БлокирующаяГруппаТС, БлокирующееСостояниеКачества);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция НаборЗаписейСОтбором(ДокументРегистрации, Показатель,
		БлокирующаяРегистрация = Неопределено, БлокирующаяГруппаТС = Неопределено)

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);
	НаборЗаписей.Отбор.Показатель.Установить(Показатель);

	Если БлокирующаяРегистрация <> Неопределено Тогда
		НаборЗаписей.Отбор.БлокирующаяРегистрация.Установить(БлокирующаяРегистрация);
	КонецЕсли;

	Если БлокирующаяГруппаТС <> Неопределено Тогда
		НаборЗаписей.Отбор.БлокирующаяГруппаТС.Установить(БлокирующаяГруппаТС);
	КонецЕсли;

	Возврат НаборЗаписей;

КонецФункции

Процедура ДобавитьЗаписьБлокировки(ДокументРегистрации, Показатель,
		БлокирующаяРегистрация, БлокирующаяГруппаТС, БлокирующееСостояниеКачества)

	НаборЗаписей = НаборЗаписейСОтбором(ДокументРегистрации, Показатель,
		БлокирующаяРегистрация, БлокирующаяГруппаТС);

	Запись = НаборЗаписей.Добавить();
	Запись.ДокументРегистрации = ДокументРегистрации;
	Запись.Показатель = Показатель;
	Запись.БлокирующаяРегистрация = БлокирующаяРегистрация;
	Запись.БлокирующаяГруппаТС = БлокирующаяГруппаТС;
	Запись.БлокирующееСостояниеКачества = БлокирующееСостояниеКачества;
	Запись.Разблокировано = Ложь;

	НаборЗаписей.Записать();

КонецПроцедуры

Функция ГруппаТСТребуетБлокировки(БлокирующаяГруппаТС, АнализГруппыЗавершен, СостояниеКачестваГруппы)

	Возврат ЗначениеЗаполнено(БлокирующаяГруппаТС)
		И Не АнализГруппыЗавершен
		И (СостояниеКачестваГруппы <> Перечисления.гкс_СостоянияКачества.КачествоНеПринято
		Или СостояниеКачестваГруппы <> Перечисления.гкс_СостоянияКачества.РезультатыПробПолучены);

КонецФункции


Функция ПервоеТСТребуетБлокировки(СостояниеКачестваПервоеТС)

	Возврат
		СостояниеКачестваПервоеТС = Перечисления.гкс_СостоянияКачества.ОтборПроб
		Или СостояниеКачестваПервоеТС = Перечисления.гкс_СостоянияКачества.ПустаяСсылка();

КонецФункции

#КонецОбласти

#КонецЕсли
